//Создать скрипт модуля

<html>
  <body>
    <script type="module" src="index.js"></script>
  </body>
</html>;

/*Чтобы сделать JavaScript более модульным, чистым и удобным в сопровождении; ES6 представил способ легкого совместного использования кода в файлах JavaScript. Это включает в себя экспорт частей файла для использования в одном или нескольких других файлах и импорт нужных частей туда, где они вам нужны. Чтобы воспользоваться этой функцией, вам необходимо создать в своем HTML-документе скрипт с typeрасширением module. Вот пример:

<script type="module" src="filename.js"></script>
Скрипт, использующий этот moduleтип, теперь может использовать функции importи export, о которых вы узнаете в предстоящих испытаниях.*/
