//Создайте обещание JavaScript
/*Обещание в JavaScript — это именно то, на что оно похоже — вы используете его, чтобы пообещать что-то сделать, обычно асинхронно. Когда задача будет выполнена, вы либо выполните свое обещание, либо не сделаете этого. — это функция-конструктор, поэтому для ее создания Promiseвам нужно использовать ключевое слово. newВ качестве аргумента он принимает функцию с двумя параметрами — resolveи reject. Это методы, используемые для определения результата обещания. Синтаксис выглядит следующим образом:

const myPromise = new Promise((resolve, reject) => {

});
*/
//Создайте новое обещание под названием makeServerRequest. Передайте функцию с параметрами resolveи rejectв конструктор.
const makeServerRequest = new Promise((resolve, reject) => {});
